"""
Создать список [18, 14, 10, 6, 2] с помощью функции range() и вывести его на экран
"""
list_range = list(range(18, 1, -4))

print(list_range)
